In [1]:
import pandas as pd
import numpy as np

# Creating a DataFrame with NaN values
data = {'Name': ['Alice', 'Bob', np.nan, 'David'],
        'Age': [25, np.nan, 30, 22],
        'Salary': [50000, 60000, np.nan, 45000]}

In [2]:
print(data)

{'Name': ['Alice', 'Bob', nan, 'David'], 'Age': [25, nan, 30, 22], 'Salary': [50000, 60000, nan, 45000]}

In [3]:
df = pd.DataFrame(data)
print(df)
print("**** isna ***")
print(df.isna())
#print(df.isnull())

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2    NaN  30.0      NaN
3  David  22.0  45000.0
****isna***
    Name    Age  Salary
0  False  False   False
1  False   True   False
2   True  False    True
3  False  False   False

In [4]:
df.dropna()

    Name   Age   Salary
0  Alice  25.0  50000.0
3  David  22.0  45000.0

In [5]:
print(df)

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2    NaN  30.0      NaN
3  David  22.0  45000.0

In [6]:
print(df)

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2    NaN  30.0      NaN
3  David  22.0  45000.0

In [7]:
df.dropna(how='all')

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2    NaN  30.0      NaN
3  David  22.0  45000.0

In [8]:
df.dropna(thresh=2)

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
3  David  22.0  45000.0

In [9]:
df

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2    NaN  30.0      NaN
3  David  22.0  45000.0

In [10]:
df.fillna(0)

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   0.0  60000.0
2      0  30.0      0.0
3  David  22.0  45000.0

In [11]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
#print(df1)
print("----------------------")
print(df)

----------------------
    Name        Age   Salary
0  Alice  25.000000  50000.0
1    Bob  25.666667  60000.0
2    NaN  30.000000      NaN
3  David  22.000000  45000.0

C:\Users\tript\AppData\Local\Temp\ipykernel_26828\2407678203.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

In [12]:
df

    Name        Age   Salary
0  Alice  25.000000  50000.0
1    Bob  25.666667  60000.0
2    NaN  30.000000      NaN
3  David  22.000000  45000.0

In [13]:
df['Salary'].fillna(df['Salary'].median())

0    50000.0
1    60000.0
2    50000.0
3    45000.0
Name: Salary, dtype: float64

In [14]:
df['Name'].fillna(df['Name'].mode()[0])

0    Alice
1      Bob
2    Alice
3    David
Name: Name, dtype: object

In [15]:
df1=df.interpolate()
df1

C:\Users\tript\AppData\Local\Temp\ipykernel_26828\1352987879.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df1=df.interpolate()

    Name        Age   Salary
0  Alice  25.000000  50000.0
1    Bob  25.666667  60000.0
2    NaN  30.000000  52500.0
3  David  22.000000  45000.0

In [16]:
df['Age'].isna().sum()  
df['Age'].replace(np.nan, df['Age'].mean(), inplace=True)

C:\Users\tript\AppData\Local\Temp\ipykernel_26828\2222087768.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].replace(np.nan, df['Age'].mean(), inplace=True)